Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# agent.runtime.plan.genericArtifact.detail
source: Output a reviewable Markdown artifact and keep all tool traces auditable.
ar: أخرج مخرجات Markdown قابلة للمراجعة واجعل جميع تتبعات الأدوات قابلة للتدقيق.
de: Gib ein überprüfbares Markdown-Artefakt aus und halte alle Tool-Spuren prüfbar.
es: Genera un artefacto Markdown revisable y mantén todas las trazas de herramientas auditables.
fr: Produire un artefact Markdown révisable et garder toutes les traces d'outils audibles.
id: Keluarkan artefak Markdown yang dapat ditinjau dan jaga semua jejak alat tetap dapat diaudit.
it: Genera un artefatto Markdown revisionabile e mantieni tutte le tracce degli strumenti verificabili.
ja: レビュー可能な Markdown アーティファクトを出力し、すべてのツールトレースを監査可能にします。
ko: 검토 가능한 Markdown 아티팩트를 출력하고 모든 도구 추적을 감사 가능하게 유지합니다.
nl: Voer een beoordeelbaar Markdown-artefact uit en houd alle tooltraces controleerbaar.
pl: Wyprowadź artefakt Markdown do przeglądu i zachowaj wszystkie ślady narzędzi do audytu.
pt_br: Gerar um artefato Markdown revisável e manter todos os rastros de ferramentas auditáveis.
ru: Выведи проверяемый артефакт Markdown и сохрани все следы инструментов для аудита.
tr: İncelenebilir bir Markdown yapıtı çıktıla ve tüm araç izlerini denetlenebilir tut.
uk: Вивести артефакт Markdown для перевірки та зберегти всі трасування інструментів для аудиту.
vi: Xuất một tạo phẩm Markdown có thể xem xét và giữ tất cả dấu vết công cụ có thể kiểm tra.
zh_hans: 输出可复查 Markdown artifact，并保留所有工具 trace 可审计。
zh_hant: 輸出可複查 Markdown artifact，並保留所有工具 trace 可審計。

# agent.runtime.plan.genericGoal.detailFormat
source: Run %@ with the selected read-only tool chain.
ar: شغّل %@ باستخدام سلسلة الأدوات المخصصة للقراءة فقط.
de: Führe %@ mit der ausgewählten schreibgeschützten Tool-Kette aus.
es: Ejecuta %@ con la cadena de herramientas seleccionada de solo lectura.
fr: Exécuter %@ avec la chaîne d'outils en lecture seule sélectionnée.
id: Jalankan %@ dengan rantai alat hanya-baca yang dipilih.
it: Esegui %@ con la catena di strumenti selezionata in sola lettura.
ja: 選択された読み取り専用ツールチェーンで %@ を実行します。
ko: 선택한 읽기 전용 도구 체인으로 %@ 실행.
nl: Voer %@ uit met de geselecteerde alleen-lezen toolketen.
pl: Uruchom %@ z wybranym łańcuchem narzędzi tylko do odczytu.
pt_br: Executar %@ com a cadeia de ferramentas selecionada somente leitura.
ru: Запустить %@ с выбранной цепочкой инструментов только для чтения.
tr: Seçilen salt okunur araç zinciriyle %@ çalıştır.
uk: Запустити %@ з вибраним ланцюжком інструментів лише для читання.
vi: Chạy %@ với chuỗi công cụ chỉ đọc đã chọn.
zh_hans: 使用选定的只读工具链执行 %@。
zh_hant: 使用選定的唯讀工具鏈執行 %@。

# agent.runtime.plan.goal.detail
source: Converge the user input into a GitHub Weekly Report and output a Markdown artifact.
ar: حول إدخال المستخدم إلى تقرير GitHub الأسبوعي وأخرج مخرجات Markdown.
de: Führe die Benutzereingabe in einen GitHub-Wochenbericht zusammen und gib ein Markdown-Artefakt aus.
es: Convierte la entrada del usuario en un informe semanal de GitHub y genera un artefacto Markdown.
fr: Converger la saisie utilisateur en un rapport hebdomadaire GitHub et produire un artefact Markdown.
id: Konvergen masukan pengguna menjadi Laporan Mingguan GitHub dan keluarkan artefak Markdown.
it: Convergi l'input utente in un report settimanale GitHub e genera un artefatto Markdown.
ja: ユーザー入力を GitHub 週報に収束させ、Markdown アーティファクトを出力します。
ko: 사용자 입력을 GitHub 주간 보고서로 수렴하고 Markdown 아티팩트를 출력합니다.
nl: Convergeer de gebruikersinvoer naar een GitHub-wekelijks rapport en voer een Markdown-artefact uit.
pl: Skonwertuj dane wejściowe użytkownika na tygodniowy raport GitHub i wyprowadź artefakt Markdown.
pt_br: Convergir a entrada do usuário em um Relatório Semanal do GitHub e gerar um artefato Markdown.
ru: Преобразуй ввод пользователя в еженедельный отчёт GitHub и выведи артефакт Markdown.
tr: Kullanıcı girdisini bir GitHub Haftalık Raporuna dönüştür ve bir Markdown yapıtı çıktıla.
uk: Звести введення користувача до щотижневого звіту GitHub та вивести артефакт Markdown.
vi: Hội tụ đầu vào người dùng thành Báo cáo hàng tuần GitHub và xuất tạo phẩm Markdown.
zh_hans: 把用户输入收敛为 GitHub Weekly Report，输出 Markdown artifact。
zh_hant: 將使用者輸入收斂為 GitHub Weekly Report，輸出 Markdown artifact。

# agent.runtime.plan.goal.title
source: Confirm output goal
ar: تأكيد هدف الإخراج
de: Ausgabeziel bestätigen
es: Confirmar objetivo de salida
fr: Confirmer l'objectif de sortie
id: Konfirmasi tujuan keluaran
it: Conferma obiettivo di output
ja: 出力目標を確認
ko: 출력 목표 확인
nl: Bevestig uitvoerdoel
pl: Potwierdź cel wyjściowy
pt_br: Confirmar objetivo de saída
ru: Подтвердить цель вывода
tr: Çıktı hedefini onayla
uk: Підтвердити мету виведення
vi: Xác nhận mục tiêu đầu ra
zh_hans: 确认输出目标
zh_hant: 確認輸出目標

# agent.runtime.step.buildDraft.detail
source: Generate the intro, topic sections, repository analysis, and closing in a technical weekly structure.
ar: أنشئ المقدمة، وأقسام المواضيع، وتحليل المستودعات، والخاتمة بهيكل أسبوعي تقني.
de: Generiere Einleitung, Themenabschnitte, Repository-Analyse und Schluss in einer technischen Wochenstruktur.
es: Genera la introducción, las secciones de temas, el análisis de repositorios y el cierre en una estructura técnica semanal.
fr: Générer l'introduction, les sections thématiques, l'analyse des dépôts et la conclusion dans une structure technique hebdomadaire.
id: Hasilkan intro, bagian topik, analisis repositori, dan penutup dalam struktur mingguan teknis.
it: Genera l'introduzione, le sezioni tematiche, l'analisi dei repository e la conclusione in una struttura tecnica settimanale.
ja: 技術週報の構造で、イントロ、トピックセクション、リポジトリ分析、結論を生成します。
ko: 기술 주간 구조로 소개, 주제 섹션, 저장소 분석 및 마무리를 생성합니다.
nl: Genereer de introductie, onderwerpsecties, repositoryanalyse en afsluiting in een technische wekelijkse structuur.
pl: Wygeneruj wstęp, sekcje tematyczne, analizę repozytorium i zakończenie w technicznej strukturze tygodniowej.
pt_br: Gerar introdução, seções de tópicos, análise de repositórios e conclusão em uma estrutura técnica semanal.
ru: Сгенерируй введение, тематические разделы, анализ репозиториев и заключение в технической еженедельной структуре.
tr: Giriş, konu bölümleri, depo analizi ve kapanışı teknik bir haftalık yapıda oluştur.
uk: Згенерувати вступ, тематичні розділи, аналіз репозиторіїв та завершення в технічній щотижневій структурі.
vi: Tạo phần giới thiệu, các phần chủ đề, phân tích kho lưu trữ và kết luận theo cấu trúc hàng tuần kỹ thuật.
zh_hans: 按技术周刊结构生成导语、主题段落、项目解读与结尾。
zh_hant: 按技術週報結構生成導語、主題段落、專案分析與結尾。

# agent.runtime.step.buildDraft.title
source: Generate weekly draft
ar: إنشاء مسودة أسبوعية
de: Wochenentwurf generieren
es: Generar borrador semanal
fr: Générer le brouillon hebdomadaire
id: Hasilkan draf mingguan
it: Genera bozza settimanale
ja: 週報ドラフトを生成
ko: 주간 초안 생성
nl: Genereer wekelijks concept
pl: Generuj szkic tygodniowy
pt_br: Gerar rascunho semanal
ru: Создать черновик еженедельного отчёта
tr: Haftalık taslağı oluştur
uk: Створити чернетку тижневого звіту
vi: Tạo bản nháp hàng tuần
zh_hans: 生成周刊母稿
zh_hant: 生成週報母稿

# agent.runtime.step.clusterTopics.detail
source: Converge candidate repositories into weekly report sections by language and topic.
ar: جمع المستودعات المرشحة في أقسام التقرير الأسبوعي حسب اللغة والموضوع.
de: Führe Kandidaten-Repositories nach Sprache und Thema in Wochenberichtsabschnitte zusammen.
es: Agrupa los repositorios candidatos en secciones del informe semanal por lenguaje y tema.
fr: Converger les dépôts candidats en sections de rapport hebdomadaire par langage et sujet.
id: Konvergen repositori kandidat menjadi bagian laporan mingguan berdasarkan bahasa dan topik.
it: Convergi i repository candidati in sezioni del report settimanale per linguaggio e argomento.
ja: 候補リポジトリを言語とトピックごとに週報セクションに収束させます。
ko: 후보 저장소를 언어 및 주제별로 주간 보고서 섹션으로 수렴합니다.
nl: Convergeer kandidaatrepositories naar wekelijkse rapportsecties op taal en onderwerp.
pl: Połącz repozytoria kandydujące w sekcje raportu tygodniowego według języka i tematu.
pt_br: Convergir repositórios candidatos em seções do relatório semanal por linguagem e tópico.
ru: Объедини репозитории-кандидаты в разделы еженедельного отчёта по языкам и темам.
tr: Aday depoları dil ve konuya göre haftalık rapor bölümlerinde birleştir.
uk: Звести репозиторії-кандидати до розділів щотижневого звіту за мовою та темою.
vi: Hội tụ các kho lưu trữ ứng viên thành các phần báo cáo hàng tuần theo ngôn ngữ và chủ đề.
zh_hans: 把候选仓库按语言和主题收敛为周刊段落。
zh_hant: 將候選倉庫按語言和主題收斂為週報段落。

# agent.runtime.step.clusterTopics.title
source: Cluster topics
ar: تجميع المواضيع
de: Themen clustern
es: Agrupar temas
fr: Regrouper les sujets
id: Klaster topik
it: Raggruppa argomenti
ja: トピックをクラスタリング
ko: 주제 클러스터링
nl: Cluster onderwerpen
pl: Grupuj tematy
pt_br: Agrupar tópicos
ru: Сгруппировать темы
tr: Konuları kümele
uk: Кластеризувати теми
vi: Phân cụm chủ đề
zh_hans: 聚类主题
zh_hant: 聚類主題

# agent.runtime.step.externalSearch.detail
source: Search external sources using the Settings External Search configuration. When disabled, record skipped and continue.
ar: ابحث في المصادر الخارجية باستخدام إعدادات البحث الخارجي. عند التعطيل، سجل التخطي واستمر.
de: Durchsuche externe Quellen mit der Konfiguration der externen Suche in den Einstellungen. Wenn deaktiviert, als übersprungen vermerken und fortfahren.
es: Busca fuentes externas usando la configuración de Búsqueda externa. Cuando esté deshabilitado, registra como omitido y continúa.
fr: Rechercher des sources externes en utilisant la configuration de recherche externe des Réglages. Si désactivé, enregistrer comme ignoré et continuer.
id: Cari sumber eksternal menggunakan konfigurasi Pencarian Eksternal Pengaturan. Jika dinonaktifkan, catat sebagai dilewati dan lanjutkan.
it: Cerca fonti esterne utilizzando la configurazione di Ricerca Esterna delle Impostazioni. Se disabilitato, registra come saltato e continua.
ja: 設定の外部検索設定を使用して外部ソースを検索します。無効の場合はスキップを記録して続行します。
ko: 설정 외부 검색 구성을 사용하여 외부 소스를 검색합니다. 비활성화된 경우 건너뛰기로 기록하고 계속합니다.
nl: Doorzoek externe bronnen met de Instellingen Extern Zoeken-configuratie. Indien uitgeschakeld, noteer overgeslagen en ga verder.
pl: Przeszukaj zewnętrzne źródła używając konfiguracji wyszukiwania zewnętrznego. Gdy wyłączone, zanotuj pominięcie i kontynuuj.
pt_br: Pesquisar fontes externas usando a configuração de Pesquisa Externa. Quando desabilitado, registrar como ignorado e continuar.
ru: Выполни поиск во внешних источниках, используя конфигурацию внешнего поиска в настройках. Если отключено, запиши пропуск и продолжай.
tr: Ayarlar Harici Arama yapılandırmasını kullanarak harici kaynakları ara. Devre dışıysa, atlandı olarak kaydet ve devam et.
uk: Пошукати зовнішні джерела, використовуючи конфігурацію зовнішнього пошуку в налаштуваннях. Якщо вимкнено, записати пропуск і продовжити.
vi: Tìm kiếm nguồn bên ngoài bằng cấu hình Tìm kiếm bên ngoài trong Cài đặt. Khi bị tắt, ghi lại đã bỏ qua và tiếp tục.
zh_hans: 按设置页 External Search 配置检索外部来源，关闭时记录 skipped 并继续。
zh_hant: 按設定頁 External Search 設定檢索外部來源，關閉時記錄 skipped 並繼續。

# agent.runtime.step.externalSearch.title
source: Add external sources
ar: إضافة مصادر خارجية
de: Externe Quellen hinzufügen
es: Añadir fuentes externas
fr: Ajouter des sources externes
id: Tambahkan sumber eksternal
it: Aggiungi fonti esterne
ja: 外部ソースを追加
ko: 외부 소스 추가
nl: Voeg externe bronnen toe
pl: Dodaj źródła zewnętrzne
pt_br: Adicionar fontes externas
ru: Добавить внешние источники
tr: Harici kaynaklar ekle
uk: Додати зовнішні джерела
vi: Thêm nguồn bên ngoài
zh_hans: 补充外部来源
zh_hant: 補充外部來源

# agent.runtime.step.genericTool.detailFormat
source: Run Agent tool: %@.
ar: تشغيل أداة الوكيل: %@.
de: Agent-Tool ausführen: %@.
es: Ejecutar herramienta del agente: %@.
fr: Exécuter l'outil de l'agent : %@.
id: Jalankan alat Agen: %@.
it: Esegui strumento agente: %@.
ja: エージェントツールを実行: %@。
ko: 에이전트 도구 실행: %@.
nl: Voer Agent-tool uit: %@.
pl: Uruchom narzędzie agenta: %@.
pt_br: Executar ferramenta do Agente: %@.
ru: Запустить инструмент агента: %@.
tr: Ajan aracını çalıştır: %@.
uk: Запустити інструмент агента: %@.
vi: Chạy công cụ tác nhân: %@.
zh_hans: 执行 Agent tool: %@。
zh_hant: 執行 Agent tool：%@。

# agent.runtime.step.parseGoal.detail
source: Detect that the user wants a Weekly Report and confirm Markdown artifact output.
ar: اكتشف أن المستخدم يريد تقريرًا أسبوعيًا وأكد إخراج مخرجات Markdown.
de: Erkenne, dass der Benutzer einen Wochenbericht möchte, und bestätige die Markdown-Artefaktausgabe.
es: Detecta que el usuario quiere un informe semanal y confirma la salida de artefacto Markdown.
fr: Détecter que l'utilisateur souhaite un rapport hebdomadaire et confirmer la sortie d'artefact Markdown.
id: Deteksi bahwa pengguna menginginkan Laporan Mingguan dan konfirmasi keluaran artefak Markdown.
it: Rileva che l'utente desidera un report settimanale e conferma l'output dell'artefatto Markdown.
ja: ユーザーが週報を希望していることを検出し、Markdown アーティファクト出力を確認します。
ko: 사용자가 주간 보고서를 원한다는 것을 감지하고 Markdown 아티팩트 출력을 확인합니다.
nl: Detecteer dat de gebruiker een wekelijks rapport wil en bevestig Markdown-artefactuitvoer.
pl: Wykryj, że użytkownik chce raport tygodniowy i potwierdź wyjście artefaktu Markdown.
pt_br: Detectar que o usuário deseja um Relatório Semanal e confirmar a saída do artefato Markdown.
ru: Определи, что пользователь хочет еженедельный отчёт, и подтверди вывод артефакта Markdown.
tr: Kullanıcının Haftalık Rapor istediğini algıla ve Markdown yapıtı çıktısını onayla.
uk: Визначити, що користувач хоче щотижневий звіт, і підтвердити виведення артефакту Markdown.
vi: Phát hiện người dùng muốn Báo cáo hàng tuần và xác nhận đầu ra tạo phẩm Markdown.
zh_hans: 识别用户希望生成 Weekly Report，并确认输出为 Markdown artifact。
zh_hant: 識別使用者希望生成 Weekly Report，並確認輸出為 Markdown artifact。

# agent.runtime.step.parseGoal.title
source: Parse task goal
ar: تحليل هدف المهمة
de: Aufgabenziel parsen
es: Analizar objetivo de la tarea
fr: Analyser l'objectif de la tâche
id: Parsing tujuan tugas
it: Analizza obiettivo attività
ja: タスク目標を解析
ko: 작업 목표 분석
nl: Parseer taakdoel
pl: Parsuj cel zadania
pt_br: Interpretar objetivo da tarefa
ru: Разобрать цель задачи
tr: Görev hedefini ayrıştır
uk: Розпізнати мету завдання
vi: Phân tích mục tiêu nhiệm vụ
zh_hans: 解析任务目标
zh_hant: 解析任務目標

# agent.runtime.step.resolveRepos.detail
source: Read the frozen Starcat repository snapshot.
ar: اقرأ لقطة مستودع Starcat المجمدة.
de: Lese den eingefrorenen Starcat-Repository-Snapshot.
es: Lee la instantánea congelada del repositorio de Starcat.
fr: Lire l'instantané figé du dépôt Starcat.
id: Baca snapshot repositori Starcat yang dibekukan.
it: Leggi lo snapshot congelato del repository Starcat.
ja: 固定された Starcat リポジトリスナップショットを読み取ります。
ko: 고정된 Starcat 저장소 스냅샷을 읽습니다.
nl: Lees de bevroren Starcat-repositorysnapshot.
pl: Odczytaj zamrożony migawkę repozytorium Starcat.
pt_br: Ler o instantâneo congelado do repositório Starcat.
ru: Прочитай замороженный снимок репозитория Starcat.
tr: Dondurulmuş Starcat depo anlık görüntüsünü oku.
uk: Прочитати заморожений знімок репозиторію Starcat.
vi: Đọc ảnh chụp nhanh kho lưu trữ Starcat đã đóng băng.
zh_hans: 读取冻结的 Starcat 仓库快照。
zh_hant: 讀取凍結的 Starcat 倉庫快照。

# agent.runtime.step.resolveRepos.title
source: Prepare data source
ar: تحضير مصدر البيانات
de: Datenquelle vorbereiten
es: Preparar fuente de datos
fr: Préparer la source de données
id: Siapkan sumber data
it: Prepara origine dati
ja: データソースを準備
ko: 데이터 소스 준비
nl: Bereid gegevensbron voor
pl: Przygotuj źródło danych
pt_br: Preparar fonte de dados
ru: Подготовить источник данных
tr: Veri kaynağını hazırla
uk: Підготувати джерело даних
vi: Chuẩn bị nguồn dữ liệu
zh_hans: 准备数据源
zh_hant: 準備資料源

# agent.runtime.trace.llm.title
source: Generate weekly report with AI
ar: إنشاء التقرير الأسبوعي باستخدام الذكاء الاصطناعي
de: Wochenbericht mit KI generieren
es: Generar informe semanal con IA
fr: Générer le rapport hebdomadaire avec l'IA
id: Hasilkan laporan mingguan dengan AI
it: Genera report settimanale con AI
ja: AIで週次レポートを生成
ko: AI로 주간 보고서 생성
nl: Genereer wekelijks rapport met AI
pl: Generuj raport tygodniowy z AI
pt_br: Gerar relatório semanal com IA
ru: Создать еженедельный отчёт с помощью ИИ
tr: Yapay zeka ile haftalık rapor oluştur
uk: Створити щотижневий звіт за допомогою ШІ
vi: Tạo báo cáo hàng tuần với AI
zh_hans: AI 生成周刊正文
zh_hant: 使用 AI 生成每週報告

# agent.runtime.trace.summary.failed
source: failed
ar: فشل
de: fehlgeschlagen
es: falló
fr: échec
id: gagal
it: fallito
ja: 失敗
ko: 실패
nl: mislukt
pl: niepowodzenie
pt_br: falhou
ru: не удалось
tr: başarısız
uk: не вдалося
vi: thất bại
zh_hans: 失败
zh_hant: 失敗

# agent.textGeneration.error.missingAPIKey
source: The current AI provider is missing an API key. Add the API key for that provider in Settings first.
ar: مزود الذكاء الاصطناعي الحالي يفتقد مفتاح API. أضف مفتاح API لهذا المزود في الإعدادات أولاً.
de: Dem aktuellen KI-Anbieter fehlt ein API-Schlüssel. Füge zuerst den API-Schlüssel für diesen Anbieter in den Einstellungen hinzu.
es: Al proveedor de IA actual le falta una clave API. Añade la clave API para ese proveedor en Ajustes primero.
fr: Le fournisseur d'IA actuel n'a pas de clé API. Ajoutez d'abord la clé API pour ce fournisseur dans les Réglages.
id: Penyedia AI saat ini tidak memiliki kunci API. Tambahkan kunci API untuk penyedia tersebut di Pengaturan terlebih dahulu.
it: Al provider AI corrente manca una chiave API. Aggiungi la chiave API per quel provider nelle Impostazioni.
ja: 現在のAIプロバイダにAPIキーが設定されていません。設定でプロバイダのAPIキーを追加してください。
ko: 현재 AI 제공업체에 API 키가 없습니다. 설정에서 해당 제공업체의 API 키를 추가하세요.
nl: De huidige AI-provider mist een API-sleutel. Voeg eerst de API-sleutel voor die provider toe in Instellingen.
pl: Bieżący dostawca AI nie ma klucza API. Najpierw dodaj klucz API dla tego dostawcy w Ustawieniach.
pt_br: O provedor de IA atual está sem uma chave de API. Adicione a chave de API para esse provedor nas Configurações primeiro.
ru: У текущего AI-провайдера отсутствует API-ключ. Сначала добавьте API-ключ для этого провайдера в настройках.
tr: Geçerli AI sağlayıcısında API anahtarı eksik. Önce Ayarlar'dan o sağlayıcı için API anahtarını ekleyin.
uk: У поточного постачальника ШІ відсутній ключ API. Спочатку додайте ключ API для цього постачальника в налаштуваннях.
vi: Nhà cung cấp AI hiện tại thiếu khóa API. Thêm khóa API cho nhà cung cấp đó trong Cài đặt trước.
zh_hans: 当前 AI Provider 缺少 API Key。请先到设置页填写对应服务商的 API Key。
zh_hant: 目前 AI 提供者缺少 API 金鑰。請先在設定中新增該提供者的 API 金鑰。

# agent.textGeneration.error.missingProvider
source: No available AI provider is configured. Configure and test an AI provider in Settings first.
ar: لا يوجد مزود ذكاء اصطناعي متاح مهيأ. قم بتهيئة واختبار مزود ذكاء اصطناعي في الإعدادات أولاً.
de: Es ist kein verfügbarer KI-Anbieter konfiguriert. Konfiguriere und teste zuerst einen KI-Anbieter in den Einstellungen.
es: No hay ningún proveedor de IA disponible configurado. Configura y prueba un proveedor de IA en Ajustes primero.
fr: Aucun fournisseur d'IA disponible n'est configuré. Configurez et testez d'abord un fournisseur d'IA dans les Réglages.
id: Tidak ada penyedia AI yang tersedia yang dikonfigurasi. Konfigurasikan dan uji penyedia AI di Pengaturan terlebih dahulu.
it: Nessun provider AI disponibile configurato. Configura e testa un provider AI nelle Impostazioni.
ja: 利用可能なAIプロバイダが設定されていません。設定でAIプロバイダを構成し、テストしてください。
ko: 사용 가능한 AI 제공업체가 구성되지 않았습니다. 설정에서 AI 제공업체를 구성하고 테스트하세요.
nl: Er is geen beschikbare AI-provider geconfigureerd. Configureer en test eerst een AI-provider in Instellingen.
pl: Nie skonfigurowano żadnego dostępnego dostawcy AI. Najpierw skonfiguruj i przetestuj dostawcę AI w Ustawieniach.
pt_br: Nenhum provedor de IA disponível está configurado. Configure e teste um provedor de IA nas Configurações primeiro.
ru: Не настроен ни один доступный AI-провайдер. Сначала настройте и протестируйте AI-провайдера в настройках.
tr: Kullanılabilir bir AI sağlayıcısı yapılandırılmamış. Önce Ayarlar'da bir AI sağlayıcısı yapılandırın ve test edin.
uk: Не налаштовано жодного доступного постачальника ШІ. Спочатку налаштуйте та протестуйте постачальника ШІ в налаштуваннях.
vi: Không có nhà cung cấp AI nào khả dụng được cấu hình. Cấu hình và kiểm tra nhà cung cấp AI trong Cài đặt trước.
zh_hans: 未配置可用的 AI Provider。请先到设置页完成 AI 服务商配置和连接测试。
zh_hant: 未設定可用的 AI 提供者。請先在設定中設定並測試 AI 提供者。

# agent.workspace.assistant.completedFallback
source: This Agent run is complete. The key plan, tool process, and artifact references are preserved below; use the right pane to view, copy, or export artifacts.
ar: اكتمل تشغيل الوكيل هذا. الخطة الرئيسية، وعملية الأدوات، ومراجع المخرجات محفوظة أدناه؛ استخدم الجزء الأيمن للعرض أو النسخ أو التصدير.
de: Diese Agent-Ausführung ist abgeschlossen. Der Schlüsselplan, der Tool-Prozess und die Artefaktverweise sind unten erhalten; verwende das rechte Fenster, um Artefakte anzuzeigen, zu kopieren oder zu exportieren.
es: Esta ejecución del agente ha finalizado. El plan clave, el proceso de herramientas y las referencias de artefactos se conservan a continuación; usa el panel derecho para ver, copiar o exportar artefactos.
fr: Cette exécution de l'agent est terminée. Le plan clé, le processus d'outil et les références d'artefact sont conservés ci-dessous ; utilisez le volet droit pour afficher, copier ou exporter les artefacts.
id: Eksekusi Agen ini selesai. Rencana utama, proses alat, dan referensi artefak disimpan di bawah; gunakan panel kanan untuk melihat, menyalin, atau mengekspor artefak.
it: Questa esecuzione dell'agente è completa. Il piano chiave, il processo degli strumenti e i riferimenti agli artefatti sono conservati di seguito; usa il pannello destro per visualizzare, copiare o esportare gli artefatti.
ja: このエージェントの実行は完了しました。主要な計画、ツールのプロセス、アーティファクトの参照は以下に保持されています。右ペインでアーティファクトの表示、コピー、エクスポートができます。
ko: 이 에이전트 실행이 완료되었습니다. 주요 계획, 도구 프로세스 및 아티팩트 참조는 아래에 보존되어 있습니다. 오른쪽 창을 사용하여 아티팩트를 보거나 복사하거나 내보내십시오.
nl: Deze Agent-uitvoering is voltooid. Het belangrijkste plan, toolproces en artefactverwijzingen zijn hieronder bewaard; gebruik het rechterpaneel om artefacten te bekijken, kopiëren of exporteren.
pl: To uruchomienie agenta jest zakończone. Kluczowy plan, proces narzędzi i odniesienia do artefaktów są zachowane poniżej; użyj prawego panelu, aby wyświetlić, skopiować lub wyeksportować artefakty.
pt_br: Esta execução do Agente está concluída. O plano principal, o processo da ferramenta e as referências de artefatos são preservados abaixo; use o painel direito para visualizar, copiar ou exportar artefatos.
ru: Этот запуск агента завершён. Ключевой план, процесс инструментов и ссылки на артефакты сохранены ниже; используйте правую панель для просмотра, копирования или экспорта артефактов.
tr: Bu Ajan çalıştırması tamamlandı. Ana plan, araç süreci ve yapıt referansları aşağıda korunmaktadır; yapıtları görüntülemek, kopyalamak veya dışa aktarmak için sağ paneli kullanın.
uk: Цей запуск агента завершено. Ключовий план, процес інструментів та посилання на артефакти збережено нижче; використовуйте праву панель для перегляду, копіювання або експорту артефактів.
vi: Lần chạy tác nhân này đã hoàn tất. Kế hoạch chính, quy trình công cụ và tham chiếu tạo phẩm được giữ lại bên dưới; sử dụng ngăn bên phải để xem, sao chép hoặc xuất tạo phẩm.
zh_hans: 我已经完成这轮 Agent run。下面保留了关键计划、工具过程和产物引用，右侧可以查看、复制或导出产出物。
zh_hant: 此 Agent 執行已完成。下方保留了關鍵計畫、工具流程和產出物參考；可使用右側面板檢視、複製或匯出產出物。

# agent.workspace.badge.preview
source: Preview
ar: معاينة
de: Vorschau
es: Vista previa
fr: Aperçu
id: Pratinjau
it: Anteprima
ja: プレビュー
ko: 미리보기
nl: Voorbeeld
pl: Podgląd
pt_br: Visualizar
ru: Предпросмотр
tr: Önizleme
uk: Попередній перегляд
vi: Xem trước
zh_hans: 预告
zh_hant: 預覽
